# Direction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BeamSystem..::..Direction Property
BeamSystem Class See Also
---
The Direction of the BeamSystem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Direction { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Direction As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Direction {
	XYZ^ get ();
}
```

# See Also
BeamSystem Class
Autodesk.Revit.DB Namespace